MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M451MLG6AE/mcu.h
#define PDMA_REQSEL4_7_REQSRC4_Pos       (0)                                               /*!< PDMA_T::REQSEL4_7: REQSRC4 Position       */
#define PDMA_REQSEL4_7_REQSRC4_Msk       (0x1ful << PDMA_REQSEL4_7_REQSRC4_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC4 Mask           */

#define PDMA_REQSEL4_7_REQSRC5_Pos       (8)                                               /*!< PDMA_T::REQSEL4_7: REQSRC5 Position       */
#define PDMA_REQSEL4_7_REQSRC5_Msk       (0x1ful << PDMA_REQSEL4_7_REQSRC5_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC5 Mask           */

#define PDMA_REQSEL4_7_REQSRC6_Pos       (16)                                              /*!< PDMA_T::REQSEL4_7: REQSRC6 Position       */
#define PDMA_REQSEL4_7_REQSRC6_Msk       (0x1ful << PDMA_REQSEL4_7_REQSRC6_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC6 Mask           */

#define PDMA_REQSEL4_7_REQSRC7_Pos       (24)                                              /*!< PDMA_T::REQSEL4_7: REQSRC7 Position       */
#define PDMA_REQSEL4_7_REQSRC7_Msk       (0x1ful << PDMA_REQSEL4_7_REQSRC7_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC7 Mask           */

#define PDMA_REQSEL8_11_REQSRC8_Pos      (0)                                               /*!< PDMA_T::REQSEL8_11: REQSRC8 Position      */
#define PDMA_REQSEL8_11_REQSRC8_Msk      (0x1ful << PDMA_REQSEL8_11_REQSRC8_Pos)           /*!< PDMA_T::REQSEL8_11: REQSRC8 Mask          */

#define PDMA_REQSEL8_11_REQSRC9_Pos      (8)                                               /*!< PDMA_T::REQSEL8_11: REQSRC9 Position      */
#define PDMA_REQSEL8_11_REQSRC9_Msk      (0x1ful << PDMA_REQSEL8_11_REQSRC9_Pos)           /*!< PDMA_T::REQSEL8_11: REQSRC9 Mask          */

#define PDMA_REQSEL8_11_REQSRC10_Pos     (16)                                              /*!< PDMA_T::REQSEL8_11: REQSRC10 Position     */
#define PDMA_REQSEL8_11_REQSRC10_Msk     (0x1ful << PDMA_REQSEL8_11_REQSRC10_Pos)          /*!< PDMA_T::REQSEL8_11: REQSRC10 Mask         */

#define PDMA_REQSEL8_11_REQSRC11_Pos     (24)                                              /*!< PDMA_T::REQSEL8_11: REQSRC11 Position     */
#define PDMA_REQSEL8_11_REQSRC11_Msk     (0x1ful << PDMA_REQSEL8_11_REQSRC11_Pos)          /*!< PDMA_T::REQSEL8_11: REQSRC11 Mask         */

/**@}*/ /* PDMA_CONST */
/**@}*/ /* end of PDMA register group */


/*---------------------- Pulse Width Modulation Controller -------------------------*/
/**
    @addtogroup PWM Pulse Width Modulation Controller(PWM)
    Memory Mapped Structure for PWM Controller
@{ */


typedef struct
{


/**
 * @var PWM_T::CTL0
 * Offset: 0x00  PWM Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |CTRLDn    |Center Re-Load
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |In up-down counter type, PERIOD will load to PBUF at the end point of each period.
 * |        |          |CMPDAT will load to CMPBUF at the center point of a period.
 * |[13:8]  |WINLDENn  |Window Load Enable
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |0 = PERIOD will load to PBUF at the end point of each period.
 * |        |          |CMPDAT will load to CMPBUF at the end point or center point of each period by setting CTRLD bit.
 * |        |          |1 = PERIOD will load to PBUF at the end point of each period.
 * |        |          |CMPDAT will load to CMPBUF at the end point of each period when valid reload window is set.
 * |        |          |The valid reload window is set by software write 1 to PWM_LOAD register and cleared by hardware after load success.
 * |[21:16] |IMMLDENn  |Immediately Load Enable
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |0 = PERIOD will load to PBUF at the end point of each period.
 * |        |          |CMPDAT will load to CMPBUF at the end point or center point of each period by setting CTRLD bit.
 * |        |          |1 = PERIOD/CMPDAT will load to PBUF and CMPBUF immediately when software update PERIOD/CMPDAT.
 * |        |          |Note: If IMMLDENn is enabled, WINLDENn and CTRLDn will be invalid.
 * |[24]    |GROUPEN   |Group Function Enable
 * |        |          |0 = The output waveform of each PWM channel are independent.
 * |        |          |1 = Unify the PWM_CH2 and PWM_CH4 to output the same waveform as PWM_CH0 and unify the PWM_CH3 and PWM_CH5 to output the same waveform as PWM_CH1.
 * |[30]    |DBGHALT   |ICE Debug Mode Counter Halt (Write Protect)
 * |        |          |If counter halt is enabled, PWM all counters will keep current value until exit ICE debug mode.
 * |        |          |0 = ICE debug mode counter halt disable.
 * |        |          |1 = ICE debug mode counter halt enable.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[31]    |DBGTRIOFF |ICE Debug Mode Acknowledge Disable (Write Protect)
 * |        |          |0 = ICE debug mode acknowledgement effects PWM output.
 * |        |          |PWM pin will be forced as tri-state while ICE debug mode acknowledged.
 * |        |          |1 = ICE debug mode acknowledgement disabled.
 * |        |          |PWM pin will keep output no matter ICE debug mode acknowledged or not.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * @var PWM_T::CTL1
 * Offset: 0x04  PWM Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |CNTTYPEn  |PWM Counter Behavior Type
 * |        |          |Each bit n controls corresponding PWM channel n.
 * |        |          |00 = Up counter type (supports in capture mode).
 * |        |          |01 = Down count type (supports in capture mode).
 * |        |          |10 = Up-down counter type.
 * |        |          |11 = Reserved.
 * |[21:16] |CNTMODEn  |PWM Counter Mode
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |0 = Auto-reload mode.
 * |        |          |1 = One-shot mode.
 * |[26:24] |OUTMODEn  |PWM Output Mode
 * |        |          |Each bit n controls the
 * |        |          |output mode of
 * |        |          |corresponding PWM channel n.
 * |        |          |0 = PWM independent mode.
 * |        |          |1 = PWM complementary mode.
 * |        |          |Note: When operating in group function, these bits must all set to the same mode.
 * @var PWM_T::SYNC
 * Offset: 0x08  PWM Synchronization Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |PHSENn    |SYNC Phase Enable
 * |        |          |Each bit n controls corresponding PWM channel n.
 * |        |          |0 = PWM counter disable to load PHS value.
 * |        |          |1 = PWM counter enable to load PHS value.
 * |[13:8]  |SINSRCn   |PWM_SYNC_IN Source Selection
 * |        |          |Each bit n controls corresponding PWM channel n.
 * |        |          |00 = Synchronize source from SYNC_IN or SWSYNC.
 * |        |          |01 = Counter equal to 0.
 * |        |          |10 = Counter equal to PWM_CMPDATm, m denotes 1, 3, 5.
 * |        |          |11 = SYNC_OUT will not be generated.
 * |[16]    |SNFLTEN   |PWM_SYNC_IN Noise Filter Enable
 * |        |          |0 = Noise filter of input pin PWM_SYNC_IN is Disabled.
 * |        |          |1 = Noise filter of input pin PWM_SYNC_IN is Enabled.
 * |[19:17] |SFLTCSEL  |SYNC Edge Detector Filter Clock Selection
 * |        |          |000 = Filter clock = HCLK.
 * |        |          |001 = Filter clock = HCLK/2.
 * |        |          |010 = Filter clock = HCLK/4.
 * |        |          |011 = Filter clock = HCLK/8.
 * |        |          |100 = Filter clock = HCLK/16.
 * |        |          |101 = Filter clock = HCLK/32.
 * |        |          |110 = Filter clock = HCLK/64.
 * |        |          |111 = Filter clock = HCLK/128.
 * |[22:20] |SFLTCNT   |SYNC Edge Detector Filter Count
 * |        |          |The register bits control the counter number of edge detector.
 * |[23]    |SINPINV   |SYNC Input Pin Inverse
 * |        |          |0 = The state of pin SYNC is passed to the negative edge detector.
 * |        |          |1 = The inverted state of pin SYNC is passed to the negative edge detector.
 * |[26:24] |PHSDIRn   |PWM Phase Direction Control
 * |        |          |Each bit n controls corresponding PWM channel n.
 * |        |          |0 = Control PWM counter count decrement after synchronizing.
 * |        |          |1 = Control PWM counter count increment after synchronizing.
 * @var PWM_T::SWSYNC
 * Offset: 0x0C  PWM Software Control Synchronization Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |SWSYNCn   |Software SYNC Function
 * |        |          |Each bit n controls corresponding PWM channel n.
 * |        |          |When SINSRCn (PWM_SYNC[13:8]) is selected to 0, SYNC_OUT source is come from SYNC_IN or this bit.
 * @var PWM_T::CLKSRC
 * Offset: 0x10  PWM Clock Source Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |ECLKSRC0  |PWM_CH01 External Clock Source Select
 * |        |          |000 = PWMx_CLK, x denotes 0 or 1.
 * |        |          |001 = TIMER0 overflow.
 * |        |          |010 = TIMER1 overflow.
 * |        |          |011 = TIMER2 overflow.
 * |        |          |100 = TIMER3 overflow.
 * |        |          |Others = Reserved.
 * |[10:8]  |ECLKSRC2  |PWM_CH23 External Clock Source Select
 * |        |          |000 = PWMx_CLK, x denotes 0 or 1.
 * |        |          |001 = TIMER0 overflow.
 * |        |          |010 = TIMER1 overflow.
 * |        |          |011 = TIMER2 overflow.
 * |        |          |100 = TIMER3 overflow.
 * |        |          |Others = Reserved.
 * |[18:16] |ECLKSRC4  |PWM_CH45 External Clock Source Select
 * |        |          |000 = PWMx_CLK, x denotes 0 or 1.
 * |        |          |001 = TIMER0 overflow.
 * |        |          |010 = TIMER1 overflow.
 * |        |          |011 = TIMER2 overflow.
 * |        |          |100 = TIMER3 overflow.
 * |        |          |Others = Reserved.
 * @var PWM_T::CLKPSC0_1
 * Offset: 0x14  PWM Clock Pre-scale Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |CLKPSC    |PWM Counter Clock Pre-Scale
 * |        |          |The clock of PWM counter is decided by clock prescaler.
 * |        |          |Each PWM pair share one PWM counter clock prescaler.
 * |        |          |The clock of PWM counter is divided by (CLKPSC+ 1).
 * @var PWM_T::CLKPSC2_3
 * Offset: 0x18  PWM Clock Pre-scale Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |CLKPSC    |PWM Counter Clock Pre-Scale
 * |        |          |The clock of PWM counter is decided by clock prescaler.
 * |        |          |Each PWM pair share one PWM counter clock prescaler.
 * |        |          |The clock of PWM counter is divided by (CLKPSC+ 1).
 * @var PWM_T::CLKPSC4_5
 * Offset: 0x1C  PWM Clock Pre-scale Register 4
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |CLKPSC    |PWM Counter Clock Pre-Scale
 * |        |          |The clock of PWM counter is decided by clock prescaler.
 * |        |          |Each PWM pair share one PWM counter clock prescaler.
 * |        |          |The clock of PWM counter is divided by (CLKPSC+ 1).
 * @var PWM_T::CNTEN
 * Offset: 0x20  PWM Counter Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |CNTENn    |PWM Counter Enable
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |0 = PWM Counter and clock prescaler Stop Running.
 * |        |          |1 = PWM Counter and clock prescaler Start Running.
 * @var PWM_T::CNTCLR
 * Offset: 0x24  PWM Clear Counter Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |CNTCLRn   |Clear PWM Counter Control Bit
 * |        |          |It is automatically cleared by hardware. Each bit n controls the corresponding PWM channel n.
 * |        |          |0 = No effect.
 * |        |          |1 = Clear 16-bit PWM counter to 0000H.
 * @var PWM_T::LOAD
 * Offset: 0x28  PWM Load Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |LOADn     |Re-Load PWM Comparator Register (CMPDAT) Control Bit
 * |        |          |This bit is software write, hardware clear when current PWM period end.
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Set load window of window loading mode.
 * |        |          |Read Operation:
 * |        |          |0 = No load window is set.
 * |        |          |1 = Load window is set.
 * |        |          |Note: This bit only use in window loading mode, WINLDENn(PWM_CTL0[13:8]) = 1.
 * @var PWM_T::PERIOD
 * Offset: 0x30~0x44  PWM Period Register 0~5
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |PERIOD    |PWM Period Register
 * |        |          |Up-Count mode: In this mode, PWM counter counts from 0 to PERIOD, and restarts from 0.
 * |        |          |Down-Count mode: In this mode, PWM counter counts from PERIOD to 0, and restarts from PERIOD.
 * |        |          |PWM period time = (PERIOD+1) * PWM_CLK period.
 * |        |          |Up-Down-Count mode: In this mode, PWM counter counts from 0 to PERIOD, then decrements to 0 and repeats again.
 * |        |          |PWM period time = 2 * PERIOD * PWM_CLK period.
 * @var PWM_T::CMPDAT
 * Offset: 0x50~0x64  PWM Comparator Register 0~5
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CMP       |PWM Comparator Register
 * |        |          |CMP use to compare with CNTR to generate PWM waveform, interrupt and trigger EADC/DAC.
 * |        |          |In independent mode, CMPDAT0~5 denote as 6 independent PWM_CH0~5 compared point.
 * |        |          |In complementary mode, CMPDAT0, 2, 4 denote as first compared point, and CMPDAT1, 3, 5 denote as second compared point for the corresponding 3 complementary pairs PWM_CH0 and PWM_CH1, PWM_CH2 and PWM_CH3, PWM_CH4 and PWM_CH5.
 * @var PWM_T::DTCTL0_1
 * Offset: 0x70  PWM Dead-Time Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |DTCNT     |Dead-Time Counter (Write Protect)
 * |        |          |The dead-time can be calculated from the following formula:
 * |        |          |Dead-time = (DTCNT[11:0]+1) * PWM_CLK period.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[16]    |DTEN      |Enable Dead-Time Insertion For PWM Pair (PWM_CH0, PWM_CH1) (PWM_CH2, PWM_CH3) (PWM_CH4, PWM_CH5) (Write Protect)
 * |        |          |Dead-time insertion is only active when this pair of complementary PWM is enabled.
 * |        |          |If dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.
 * |        |          |0 = Dead-time insertion Disabled on the pin pair.
 * |        |          |1 = Dead-time insertion Enabled on the pin pair.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[24]    |DTCKSEL   |Dead-Time Clock Select (Write Protect) (M45xD/M45xC Only)
 * |        |          |0 = Dead-time clock source from PWM_CLK.
 * |        |          |1 = Dead-time clock source from prescaler output.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * @var PWM_T::DTCTL2_3
 * Offset: 0x74  PWM Dead-Time Control Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |DTCNT     |Dead-Time Counter (Write Protect)
 * |        |          |The dead-time can be calculated from the following formula:
 * |        |          |Dead-time = (DTCNT[11:0]+1) * PWM_CLK period.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[16]    |DTEN      |Enable Dead-Time Insertion For PWM Pair (PWM_CH0, PWM_CH1) (PWM_CH2, PWM_CH3) (PWM_CH4, PWM_CH5) (Write Protect)
 * |        |          |Dead-time insertion is only active when this pair of complementary PWM is enabled.
 * |        |          |If dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.
 * |        |          |0 = Dead-time insertion Disabled on the pin pair.
 * |        |          |1 = Dead-time insertion Enabled on the pin pair.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[24]    |DTCKSEL   |Dead-Time Clock Select (Write Protect) (M45xD/M45xC Only)
 * |        |          |0 = Dead-time clock source from PWM_CLK.
 * |        |          |1 = Dead-time clock source from prescaler output.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * @var PWM_T::DTCTL4_5
 * Offset: 0x78  PWM Dead-Time Control Register 4
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |DTCNT     |Dead-Time Counter (Write Protect)
 * |        |          |The dead-time can be calculated from the following formula:
 * |        |          |Dead-time = (DTCNT[11:0]+1) * PWM_CLK period.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[16]    |DTEN      |Enable Dead-Time Insertion For PWM Pair (PWM_CH0, PWM_CH1) (PWM_CH2, PWM_CH3) (PWM_CH4, PWM_CH5) (Write Protect)
 * |        |          |Dead-time insertion is only active when this pair of complementary PWM is enabled.
 * |        |          |If dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.
 * |        |          |0 = Dead-time insertion Disabled on the pin pair.
 * |        |          |1 = Dead-time insertion Enabled on the pin pair.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[24]    |DTCKSEL   |Dead-Time Clock Select (Write Protect) (M45xD/M45xC Only)
 * |        |          |0 = Dead-time clock source from PWM_CLK.
 * |        |          |1 = Dead-time clock source from prescaler output.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * @var PWM_T::PHS0_1
 * Offset: 0x80  PWM Counter Phase Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |PHS       |PWM Synchronous Start Phase Bits
 * |        |          |PHS determines the PWM synchronous start phase value. These bits only use in synchronous function.
 * @var PWM_T::PHS2_3
 * Offset: 0x84  PWM Counter Phase Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |PHS       |PWM Synchronous Start Phase Bits
 * |        |          |PHS determines the PWM synchronous start phase value. These bits only use in synchronous function.
 * @var PWM_T::PHS4_5
 * Offset: 0x88  PWM Counter Phase Register 4
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |PHS       |PWM Synchronous Start Phase Bits
 * |        |          |PHS determines the PWM synchronous start phase value. These bits only use in synchronous function.
 * @var PWM_T::CNT
 * Offset: 0x90~0xA4  PWM Counter Register 0~5
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CNT       |PWM Data Register (Read Only)
 * |        |          |User can monitor CNTR to know the current value in 16-bit period counter.
 * |[16]    |DIRF      |PWM Direction Indicator Flag (Read Only)
 * |        |          |0 = Counter is Down count.
 * |        |          |1 = Counter is UP count.
 * @var PWM_T::WGCTL0
 * Offset: 0xB0  PWM Generation Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |ZPCTLn    |PWM Zero Point Control
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |00 = Do nothing.
 * |        |          |01 = PWM zero point output Low.
 * |        |          |10 = PWM zero point output High.
 * |        |          |11 = PWM zero point output Toggle.
 * |        |          |PWM can control output level when PWM counter count to zero.
 * |[27:16] |PRDPCTLn  |PWM Period (Center) Point Control
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |00 = Do nothing.
 * |        |          |01 = PWM period (center) point output Low.
 * |        |          |10 = PWM period (center) point output High.
 * |        |          |11 = PWM period (center) point output Toggle.
 * |        |          |PWM can control output level when PWM counter count to (PERIODn+1).
 * |        |          |Note: This bit is center point control when PWM counter operating in up-down counter type.
 * @var PWM_T::WGCTL1
 * Offset: 0xB4  PWM Generation Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |CMPUCTLn  |PWM Compare Up Point Control
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |00 = Do nothing.
 * |        |          |01 = PWM compare up point output Low.
 * |        |          |10 = PWM compare up point output High.
 * |        |          |11 = PWM compare up point output Toggle.
 * |        |          |PWM can control output level when PWM counter up count to CMPDAT.
