MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M451MLG6AE/mcu.h
 * |[0]     |RDAIF     |Receive Data Reach Interrupt Status Flag (Read Only)
 * |        |          |This field is used for received data reaching trigger level RXTRGLV (SC_CTL[7:6]) interrupt status flag.
 * |        |          |Note: This field is the status flag of received data reaching RXTRGLV (SC_CTL[7:6]).
 * |        |          |If software reads data from SC_DAT and receiver buffer data byte number is less than RXTRGLV (SC_CTL[7:6]), this bit will be cleared automatically.
 * |[1]     |TBEIF     |Transmit Buffer Empty Interrupt Status Flag (Read Only)
 * |        |          |This field is used for transmit buffer empty interrupt status flag.
 * |        |          |Note: This field is the status flag of transmit buffer empty state.
 * |        |          |If software wants to clear this bit, software must write data to DAT(SC_DAT[7:0]) buffer and then this bit will be cleared automatically.
 * |[2]     |TERRIF    |Transfer Error Interrupt Status Flag (Read Only)
 * |        |          |This field is used for transfer error interrupt status flag.
 * |        |          |The transfer error states is at SC_STATUS register which includes receiver break error BEF(SC_STATUS[6]), frame error FEF(SC_STATUS[5]), parity error PEF(SC_STATUS[4]) and receiver buffer overflow error RXOV(SC_STATUS[0]), transmit buffer overflow error TXOV(SC_STATUS[8]), receiver retry over limit error RXOVERR(SC_STATUS[22]) and transmitter retry over limit error TXOVERR(SC_STATUS[30]).
 * |        |          |Note: This field is the status flag of
 * |        |          |BEF(SC_STATUS[6]), FEF(SC_STATUS[5]), PEF(SC_STATUS[4]), RXOV(SC_STATUS[0]), TXOV(SC_STATUS[8]), RXOVERR(SC_STATUS[22]) or TXOVERR(SC_STATUS[30]).
 * |        |          |So, if software wants to clear this bit, software must write 1 to each field.
 * |[3]     |TMR0IF    |Timer0 Interrupt Status Flag (Read Only)
 * |        |          |This field is used for TMR0 interrupt status flag.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[4]     |TMR1IF    |Timer1 Interrupt Status Flag (Read Only)
 * |        |          |This field is used for TMR1 interrupt status flag.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[5]     |TMR2IF    |Timer2 Interrupt Status Flag (Read Only)
 * |        |          |This field is used for TMR2 interrupt status flag.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[6]     |BGTIF     |Block   Guard Time Interrupt Status Flag (Read Only)
 * |        |          |This field   is used for block guard time interrupt status flag.
 * |        |          |Note1: This bit is valid when RXBGTEN   (SC_ALTCTL[12]) is enabled.
 * |        |          |Note2: This bit is read only, but it can be cleared by   writing "1" to it.
 * |[7]     |CDIF      |Card Detect Interrupt Status Flag (Read Only)
 * |        |          |This field is used for card detect interrupt status flag.
 * |        |          |The card detect status is CINSERT (SC_STATUS[12]) and CREMOVE(SC_STATUS[11]).
 * |        |          |Note:
 * |        |          |This field is the status flag of CINSERT(SC_STATUS[12]) or CREMOVE(SC_STATUS[11])].
 * |        |          |So if software wants to clear this bit, software must write 1 to this field.
 * |[8]     |INITIF    |Initial End Interrupt Status Flag (Read Only)
 * |        |          |This field is used for activation (ACTEN(SC_ALTCTL[3])), deactivation (DACTEN (SC_ALTCTL[2])) and warm reset (WARSTEN (SC_ALTCTL[4])) sequence interrupt status flag.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[9]     |RBTOIF    |Receiver Buffer Time-Out Interrupt Status Flag (Read Only)
 * |        |          |This field is used for receiver buffer time-out interrupt status flag.
 * |        |          |Note: This field is the status flag of receiver buffer time-out state.
 * |        |          |If software wants to clear this bit, software must read all receiver buffer remaining data by reading SC_DAT buffer,.
 * |[10]    |ACERRIF   |Auto Convention Error Interrupt Status Flag (Read Only)
 * |        |          |This field indicates auto convention sequence error.
 * |        |          |If the received TS at ATR state is neither 0x3B nor 0x3F, this bit will be set.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * @var SC_T::STATUS
 * Offset: 0x20  SC Status Register.
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |RXOV      |RX Overflow Error Status Flag (Read Only)
 * |        |          |This bit is set when RX buffer overflow.
 * |        |          |If the number of received bytes is greater than Rx Buffer size (4 bytes), this bit will be set.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[1]     |RXEMPTY   |Receiver Buffer Empty Status Flag(Read Only)
 * |        |          |This bit indicates RX buffer empty or not.
 * |        |          |When the last byte of Rx buffer has been read by CPU, hardware sets this bit high.
 * |        |          |It will be cleared when SC receives any new data.
 * |[2]     |RXFULL    |Receiver Buffer Full Status Flag (Read Only)
 * |        |          |This bit indicates RX buffer full or not.
 * |        |          |This bit is set when RX pointer is equal to 4, otherwise it is cleared by hardware.
 * |[4]     |PEF       |Receiver Parity Error Status Flag (Read Only)
 * |        |          |This bit is set to logic 1 whenever the received character does not have a valid
 * |        |          |"parity bit".
 * |        |          |Note1:
 * |        |          |This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2:
 * |        |          |If CPU sets receiver retries function by setting RXRTYEN(SC_CTL[19]) , hardware will not set this flag.
 * |[5]     |FEF       |Receiver Frame Error Status Flag (Read Only)
 * |        |          |This bit is set to logic 1 whenever the received character does not have a valid "stop bit" (that is, the stop bit following the last data bit or parity bit is detected as logic 0).
 * |        |          |Note1:
 * |        |          |This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2:
 * |        |          |If CPU sets receiver retries function by setting RXRTYEN(SC_CTL[19]) , hardware will not set this flag.
 * |[6]     |BEF       |Receiver Break Error Status Flag (Read Only)
 * |        |          |This bit is set to logic 1 whenever the received data input (RX) held in the "spacing state" (logic 0) is longer than a full word transmission time (that is, the total time of "start bit" + data bits + parity + stop bits).
 * |        |          |.
 * |        |          |Note1:
 * |        |          |This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2:
 * |        |          |If CPU sets receiver retries function by setting RXRTYEN(SC_CTL[19]) , hardware will not set this flag.
 * |[8]     |TXOV      |TX Overflow Error Interrupt Status Flag (Read Only)
 * |        |          |If TX buffer is full, an additional write to DAT(SC_DAT[7:0]) will cause this bit be set to "1" by hardware.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[9]     |TXEMPTY   |Transmit Buffer Empty Status Flag (Read Only)
 * |        |          |This bit indicates TX buffer empty or not.
 * |        |          |When the last byte of TX buffer has been transferred to Transmitter Shift Register, hardware sets this bit high.
 * |        |          |It will be cleared when writing data into DAT(SC_DAT[7:0]) (TX buffer not empty).
 * |[10]    |TXFULL    |Transmit Buffer Full Status Flag (Read Only)
 * |        |          |This bit indicates TX buffer full or not.This bit is set when TX pointer is equal to 4, otherwise is cleared by hardware.
 * |[11]    |CREMOVE   |Card Detect Removal Status Of SC_CD Pin (Read Only)
 * |        |          |This bit is set whenever card has been removal.
 * |        |          |0 = No effect.
 * |        |          |1 = Card removed.
 * |        |          |Note1: This bit is read only, but it can be cleared by writing "1" to it.
 * |        |          |Note2: Card detect engine will start after SCEN (SC_CTL[0])set.
 * |[12]    |CINSERT   |Card Detect Insert Status Of SC_CD Pin (Read Only)
 * |        |          |This bit is set whenever card has been inserted.
 * |        |          |0 = No effect.
 * |        |          |1 = Card insert.
 * |        |          |Note1: This bit is read only, but it can be cleared by writing "1" to it.
 * |        |          |Note2: The
 * |        |          |card detect engine will start after SCEN (SC_CTL[0]) set.
 * |[13]    |CDPINSTS  |Card Detect Status Of SC_CD Pin Status (Read Only)
 * |        |          |This bit is the pin status flag of SC_CD
 * |        |          |0 = The SC_CD pin state at low.
 * |        |          |1 = The SC_CD pin state at high.
 * |[17:16] |RXPOINT   |Receiver Buffer Pointer Status Flag (Read Only)
 * |        |          |This field indicates the RX buffer pointer status flag.
 * |        |          |When SC receives one byte from external device, RXPOINT(SC_STATUS[17:16]) increases one.
 * |        |          |When one byte of RX buffer is read by CPU, RXPOINT(SC_STATUS[17:16]) decreases one.
 * |[21]    |RXRERR    |Receiver Retry Error (Read Only)
 * |        |          |This bit is set by hardware when RX has any error and retries transfer.
 * |        |          |Note1: This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2 This bit is a flag and cannot generate any interrupt to CPU.
 * |        |          |Note3: If CPU enables receiver retry function by setting RXRTYEN (SC_CTL[19]) , the PEF(SC_STATUS[4]) flag will be ignored (hardware will not set PEF(SC_STATUS[4])).
 * |[22]    |RXOVERR   |Receiver Over Retry Error (Read Only)
 * |        |          |This bit is set by hardware when RX transfer error retry over retry number limit.
 * |        |          |Note1: This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2: If CPU enables receiver retries function by setting RXRTYEN (SC_CTL[19]), the PEF(SC_STATUS[4]) flag will be ignored (hardware will not set PEF(SC_STATUS[4])).
 * |[23]    |RXACT     |Receiver In Active Status Flag (Read Only)
 * |        |          |This bit is set by hardware when RX transfer is in active.
 * |        |          |This bit is cleared automatically when RX transfer is finished.
 * |[25:24] |TXPOINT   |Transmit Buffer Pointer Status Flag (Read Only)
 * |        |          |This field indicates the TX buffer pointer status flag.
 * |        |          |When CPU writes data into SC_DAT, TXPOINT increases one.
 * |        |          |When one byte of TX Buffer is transferred to transmitter shift register, TXPOINT decreases one.
 * |[29]    |TXRERR    |Transmitter Retry Error (Read Only)
 * |        |          |This bit is set by hardware when transmitter re-transmits.
 * |        |          |Note1: This bit is read only, but it can be cleared by writing 1 to it.
 * |        |          |Note2 This bit is a flag and cannot generate any interrupt to CPU.
 * |[30]    |TXOVERR   |Transmitter Over Retry Error (Read Only)
 * |        |          |This bit is set by hardware when transmitter re-transmits over retry number limitation.
 * |        |          |Note: This bit is read only, but it can be cleared by writing 1 to it.
 * |[31]    |TXACT     |Transmit In Active Status Flag (Read Only)
 * |        |          |0 = This bit is cleared automatically when TX transfer is finished or the last byte transmission has completed.
 * |        |          |1 = This bit is set by hardware when TX transfer is in active and the STOP bit of the last byte has been transmitted.
 * @var SC_T::PINCTL
 * Offset: 0x24  SC Pin Control State Register.
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWREN     |SC_PWREN Pin Signal
 * |        |          |Software can set PWREN (SC_PINCTL[0]) and PWRINV (SC_PINCTL[11])to decide SC_PWR pin is in high or low level.
 * |        |          |Write this field to drive SC_PWR pin
 * |        |          |Refer PWRINV (SC_PINCTL[11]) description for programming SC_PWR pin voltage level.
 * |        |          |Read this field to get SC_PWR pin status.
 * |        |          |0 = SC_PWR pin status is low.
 * |        |          |1 = SC_PWR pin status is high.
 * |        |          |Note: When operating at activation, warm reset or deactivation mode, this bit will be changed automatically.
 * |        |          |So don't fill this field when operating in these modes.
 * |[1]     |SCRST     |SC_RST Pin Signal
 * |        |          |This bit is the pin status of SC_RST but user can drive SC_RST pin to high or low by setting this bit.
 * |        |          |Write this field to drive SC_RST pin.
 * |        |          |0 = Drive SC_RST pin to low.
 * |        |          |1 = Drive SC_RST pin to high.
 * |        |          |Read this field to get SC_RST pin status.
 * |        |          |0 = SC_RST pin status is low.
 * |        |          |1 = SC_RST pin status is high.
 * |        |          |Note: When operating at activation, warm reset or deactivation mode, this bit will be changed automatically.
 * |        |          |So don't fill this field when operating in these modes.
 * |[5]     |CSTOPLV   |SC Clock Stop Level
 * |        |          |This field indicates the clock polarity control in clock stop mode.
 * |        |          |0 = SC_CLK stopped in low level.
 * |        |          |1 = SC_CLK stopped in high level.
 * |[6]     |CLKKEEP   |SC Clock Enable Bit
 * |        |          |0 = SC clock generation Disabled.
 * |        |          |1 = SC clock always keeps free running.
 * |        |          |Note: When operating in activation, warm reset or deactivation mode, this bit will be changed automatically.
 * |        |          |So don't fill this field when operating in these modes.
 * |[9]     |SCDOUT    |SC Data Output Pin
 * |        |          |This bit is the pin status of SCDATOUT but user can drive SCDATOUT pin to high or low by setting this bit.
 * |        |          |0 = Drive SCDATOUT pin to low.
 * |        |          |1 = Drive SCDATOUT pin to high.
 * |        |          |Note: When SC is at activation, warm reset or deactivation mode, this bit will be changed automatically.
 * |        |          |So don't fill this field when SC is in these modes.
 * |[11]    |PWRINV    |SC_POW Pin Inverse
 * |        |          |This bit is used for inverse the SC_POW pin.
 * |        |          |There are four kinds of combination for SC_POW pin setting by PWRINV(SC_PINCTL[11]) and PWREN(SC_PINCTL[0]).
 * |        |          |PWRINV (SC_PINCTL[11]) is bit 1 and PWREN(SC_PINCTL[0]) is bit 0 for SC_POW_Pin as high or low voltage selection.
 * |        |          |00 = SC_POW_ Pin is 0.
 * |        |          |01 = SC_POW _Pin is 1.
 * |        |          |10 = SC_POW _Pin is 1.
 * |        |          |11 = SC_POW_ Pin is 0.
 * |        |          |Note: Software must select PWRINV (SC_PINCTL[11]) before Smart Card is enabled by SCEN (SC_CTL[0]).
 * |[12]    |SCDOSTS   |SC Data Pin Output Status
 * |        |          |This bit is the pin status of SCDATOUT
 * |        |          |0 = SCDATOUT pin to low.
 * |        |          |1 = SCDATOUT pin to high.
 * |        |          |Note: When SC is operated at activation, warm reset or deactivation mode, this bit will be changed automatically.
 * |        |          |This bit is not allowed to program when SC is operated at these modes.
 * |[16]    |DATSTS    |This bit   is the pin status of SC_DAT
 * |        |          |0 = The   SC_DAT pin is low.
 * |        |          |1 = The   SC_DAT pin is high.
 * |[17]    |PWRSTS    |SC_PWR   Pin Signal
 * |        |          |This bit   is the pin status of SC_PWR
 * |        |          |0 = SC_PWR   pin to low.
 * |        |          |1 = SC_PWR   pin to high.
 * |        |          |Note: When SC is operated at activation, warm reset or deactivation mode, this bit will be changed automatically.
 * |        |          |This bit is not allowed to program when SC is operated at these modes.
 * |[18]    |RSTSTS    |SCRST Pin Signals
 * |        |          |This bit is the pin status of SC_RST
 * |        |          |0 = SC_RST pin is low.
 * |        |          |1 = SC_RST pin is high.
 * |        |          |Note: When SC is operated at activation, warm reset or deactivation mode, this bit will be changed automatically.
 * |        |          |This bit is not allowed to program when SC is operated at these modes.
 * |[30]    |SYNC      |SYNC Flag Indicator
 * |        |          |Due to synchronization, software should check this bit when writing a new value to SC_PINCTL register.
 * |        |          |0 = Synchronizing is completion, user can write new data to SC_PINCTL register.
 * |        |          |1 = Last value is synchronizing.
 * |        |          |Note: This bit is read only.
 * |[31]    |LOOPBK    |Loop Back Test
 * |        |          |0 = loop back test Disabled.
 * |        |          |1 = Enabling loop back test and the internal SCDATOUT will connect to internal SC_DATA_I.
 * @var SC_T::TMRCTL0
 * Offset: 0x28  SC Internal Timer Control Register 0.
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[23:0]  |CNT       |Timer 0 Counter Value (ETU Base)
 * |        |          |This field indicates the internal timer operation values.
 * |[27:24] |OPMODE    |Timer 0 Operation Mode Selection
 * |        |          |This field indicates the internal 24-bit timer operation selection.
 * |        |          |Refer to 6.17.5.4 for programming Timer0
 * @var SC_T::TMRCTL1
 * Offset: 0x2C  SC Internal Timer Control Register 1.
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CNT       |Timer 1 Counter Value (ETU Base)
 * |        |          |This field indicates the internal timer operation values.
 * |[27:24] |OPMODE    |Timer 1 Operation Mode Selection
 * |        |          |This field indicates the internal 8-bit timer operation selection.
 * |        |          |Refer to 6.17.5.4 for programming Timer1
 * @var SC_T::TMRCTL2
 * Offset: 0x30  SC Internal Timer Control Register 2.
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CNT       |Timer 2 Counter Value (ETU Base)
 * |        |          |This field indicates the internal timer operation values.
 * |[27:24] |OPMODE    |Timer 2 Operation Mode Selection
 * |        |          |This field indicates the internal 8-bit timer operation selection
 * |        |          |Refer to 6.17.5.4 for programming Timer2
 * @var SC_T::UARTCTL
 * Offset: 0x34  SC UART Mode Control Register.
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |UARTEN    |UART Mode Enable Bit
 * |        |          |0 = Smart Card mode.
 * |        |          |1 = UART mode.
 * |        |          |Note1: When operating in UART mode, user must set CONSEL (SC_CTL[5:4]) = 00 and AUTOCEN(SC_CTL[3]) = 0.
 * |        |          |Note2: When operating in Smart Card mode, user must set UARTEN(SC_UARTCTL [0]) = 00.
 * |        |          |Note3: When UART is enabled, hardware will generate a reset to reset FIFO and internal state machine.
 * |[5:4]   |WLS10     |Word Length Selection
 * |        |          |00 = Word length is 8 bits.
 * |        |          |01 = Word length is 7 bits.
 * |        |          |10 = Word length is 6 bits.
 * |        |          |11 = Word length is 5 bits.
 * |        |          |Note: In smart card mode, this WLS must be '00'
 * |[6]     |PBOFF     |Parity Bit Disable Control
 * |        |          |0 = Parity bit is generated or checked between the "last data word bit" and "stop bit" of the serial data.
 * |        |          |1 = Parity bit is not generated (transmitting data) or checked (receiving data) during transfer.
 * |        |          |Note: In smart card mode, this field must be '0' (default setting is with parity bit)
 * |[7]     |OPE       |Odd Parity Enable Bit
 * |        |          |0 = Even number of logic 1's are transmitted or check the data word and parity bits in receiving mode.
 * |        |          |1 = Odd number of logic 1's are transmitted or check the data word and parity bits in receiving mode.
 * |        |          |Note: This bit has effect only when PBOFF bit is '0'.
 * @var SC_T::TMRDAT0
 * Offset: 0x38  SC Timer Current Data Register A.
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[23:0]  |CNT0      |Timer0 Current Data Value (Read Only)
 * |        |          |This field indicates the current count values of timer0.
 * @var SC_T::TMRDAT1_2
 * Offset: 0x3C  SC Timer Current Data Register B.
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CNT1      |Timer1 Current Data Value (Read Only)
 * |        |          |This field indicates the current count values of timer1.
 * |[15:8]  |CNT2      |Timer2 Current Data Value (Read Only)
 * |        |          |This field indicates the current count values of timer2.
 */

