MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M451MLG6AE/mcu.h
 * |        |          |User can check the status of this bit to monitor the reset function is doing or done.
 * |[27:24] |RXCNT     |Receive FIFO Data Count (Read Only)
 * |        |          |This bit field indicates the valid data count of receive FIFO buffer.
 * |[31:28] |TXCNT     |Transmit FIFO Data Count (Read Only)
 * |        |          |This bit field indicates the valid data count of transmit FIFO buffer.
 * @var SPI_T::TX
 * Offset: 0x20  Data Transmit Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |TX        |Data Transmit Register
 * |        |          |The data transmit registers pass through the transmitted data into the 8-/4-level transmit FIFO buffer.
 * |        |          |The number of valid bits depends on the setting of DWIDTH (SPI_CTL[12:8]).
 * |        |          |For example, if DWIDTH is set to 0x08, the bits TX[7:0] will be transmitted.
 * |        |          |If DWIDTH is set to 0x00, the SPI controller will perform a 32-bit transfer.
 * |        |          |Note: In Master mode, SPI controller will start to transfer after 5 peripheral clock cycles after user writes to this register.
 * @var SPI_T::RX
 * Offset: 0x30  Data Receive Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |RX        |Data Receive Register
 * |        |          |There are 8-/4-level FIFO buffers in this controller.
 * |        |          |The data receive register holds the data received from SPI data input pin.
 * |        |          |If the RXEMPTY (SPI_STATUS[8]) is not set to 1, the receive FIFO buffers can be accessed through software by reading this register.
 * |        |          |This is a read only register.
 * @var SPI_T::I2SCTL
 * Offset: 0x60  I2S Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |I2SEN     |I2S Controller Enable Bit
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |        |          |Note: If enable this bit, I2Sn_BCLK will start to output in master mode.
 * |[1]     |TXEN      |Transmit Enable Bit
 * |        |          |0 = Data transmit Disabled.
 * |        |          |1 = Data transmit Enabled.
 * |[2]     |RXEN      |Receive Enable Bit
 * |        |          |0 = Data receiving Disabled.
 * |        |          |1 = Data receiving Enabled.
 * |[3]     |MUTE      |Transmit Mute Enable Bit
 * |        |          |0 = Transmit data is shifted from buffer.
 * |        |          |1= Transmit channel zero.
 * |[5:4]   |WDWIDTH   |Word Width
 * |        |          |00 = data is 8-bit.
 * |        |          |01 = data is 16-bit.
 * |        |          |10 = data is 24-bit.
 * |        |          |11 = data is 32-bit.
 * |[6]     |MONO      |Monaural Data
 * |        |          |0 = Data is stereo format.
 * |        |          |1 = Data is monaural format.
 * |[7]     |ORDER     |Stereo Data Order In FIFO
 * |        |          |0 = Left channel data at high byte.
 * |        |          |1 = Left channel data at low byte.
 * |[8]     |SLAVE     |Slave Mode
 * |        |          |I2S can operate as master or slave.
 * |        |          |For Master mode, I2Sn_BCLK and I2Sn_LRCLK pins are output mode and send bit clock from NuMicro M451 series to Audio CODEC chip.
 * |        |          |In Slave mode, I2Sn_BCLK and I2Sn_LRCLK pins are input mode and I2Sn_BCLK and I2Sn_LRCLK signals are received from outer Audio CODEC chip.
 * |        |          |0 = Master mode.
 * |        |          |1 = Slave mode.
 * |[15]    |MCLKEN    |Master Clock Enable Bit
 * |        |          |If MCLKEN is set to 1, I2S controller will generate master clock on I2Sn_MCLK pin for external audio devices.
 * |        |          |0 = Master clock Disabled.
 * |        |          |1 = Master clock Enabled.
 * |[16]    |RZCEN     |Right Channel Zero Cross Detection Enable Bit
 * |        |          |If this bit is set to 1, when right channel data sign bit change or next shift data bits are all 0 then RZCIF flag in SPI_I2SSTS register is set to 1.
 * |        |          |This function is only available in transmit operation.
 * |        |          |0 = Right channel zero cross detection Disabled.
 * |        |          |1 = Right channel zero cross detection Enabled.
 * |[17]    |LZCEN     |Left Channel Zero Cross Detection Enable Bit
 * |        |          |If this bit is set to 1, when left channel data sign bit changes or next shift data bits are all 0 then LZCIF flag in SPI_I2SSTS register is set to 1.
 * |        |          |This function is only available in transmit operation.
 * |        |          |0 = Left channel zero cross detection Disabled.
 * |        |          |1 = Left channel zero cross detection Enabled.
 * |[23]    |RXLCH     |Receive Left Channel Enable Bit
 * |        |          |When monaural format is selected (MONO = 1), I2S controller will receive right channel data if RXLCH is set to 0, and receive left channel data if RXLCH is set to 1.
 * |        |          |0 = Receive right channel data in Mono mode.
 * |        |          |1 = Receive left channel data in Mono mode.
 * |[24]    |RZCIEN    |Right Channel Zero-Cross Interrupt Enable Bit
 * |        |          |Interrupt occurs if this bit is set to 1 and right channel zero-cross event occurs.
 * |        |          |0 = Interrupt Disabled.
 * |        |          |1 = Interrupt Enabled.
 * |[25]    |LZCIEN    |Left Channel Zero-Cross Interrupt Enable Bit
 * |        |          |Interrupt occurs if this bit is set to 1 and left channel zero-cross event occurs.
 * |        |          |0 = Interrupt Disabled.
 * |        |          |1 = Interrupt Enabled.
 * |[29:28] |FORMAT    |Data Format Selection
 * |        |          |00 = I2S data format.
 * |        |          |01 = MSB justified data format.
 * |        |          |10 = PCM mode A.
 * |        |          |11 = PCM mode B.
 * @var SPI_T::I2SCLK
 * Offset: 0x64  I2S Clock Divider Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |MCLKDIV   |Master Clock Divider
 * |        |          |If MCLKEN is set to 1, I2S controller will generate master clock for external audio devices.
 * |        |          |The master clock rate, F_MCLK, is determined by the following expressions.
 * |        |          |If MCLKDIV >= 1, F_MCLK = F_I2SCLK/(2x(MCLKDIV)).
 * |        |          |If MCLKDIV = 0, F_MCLK = F_I2SCLK.
 * |        |          |F_I2SCLK is the frequency of I2S peripheral clock.
 * |        |          |In general, the master clock rate is 256 times sampling clock rate.
 * |[16:8]  |BCLKDIV   |Bit Clock Divider
 * |        |          |The I2S controller will generate bit clock in Master mode.
 * |        |          |The bit clock rate, F_BCLK, is determined by the following expression.
 * |        |          |F_BCLK = F_I2SCLK /(2x(BCLKDIV + 1)) , where F_I2SCLK is the frequency of I2S peripheral clock.
 * @var SPI_T::I2SSTS
 * Offset: 0x68  I2S Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4]     |RIGHT     |Right Channel (Read Only)
 * |        |          |This bit indicates the current transmit data is belong to which channel.
 * |        |          |0 = Left channel.
 * |        |          |1 = Right channel.
 * |[8]     |RXEMPTY   |Receive FIFO Buffer Empty Indicator (Read Only)
 * |        |          |0 = Receive FIFO buffer is not empty.
 * |        |          |1 = Receive FIFO buffer is empty.
 * |[9]     |RXFULL    |Receive FIFO Buffer Full Indicator (Read Only)
 * |        |          |0 = Receive FIFO buffer is not full.
 * |        |          |1 = Receive FIFO buffer is full.
 * |[10]    |RXTHIF    |Receive FIFO Threshold Interrupt Flag (Read Only)
 * |        |          |0 = The valid data count within the Rx FIFO buffer is smaller than or equal to the setting value of RXTH.
 * |        |          |1 = The valid data count within the receive FIFO buffer is larger than the setting value of RXTH.
 * |        |          |Note: If RXTHIEN = 1 and RXTHIF = 1, the SPI/I2S controller will generate a SPI interrupt request.
 * |[11]    |RXOVIF    |Receive FIFO Overrun Interrupt Flag
 * |        |          |When the receive FIFO buffer is full, the follow-up data will be dropped and this bit will be set to 1.
 * |        |          |Note: This bit will be cleared by writing 1 to it.
 * |[12]    |RXTOIF    |Receive Time-Out Interrupt Flag
 * |        |          |0 = No receive FIFO time-out event.
 * |        |          |1 = Receive FIFO buffer is not empty and no read operation on receive FIFO buffer over 64 SPI clock period in Master mode or over 576 peripheral clock period in Slave mode.
 * |        |          |When the received FIFO buffer is read by software, the time-out status will be cleared automatically.
 * |        |          |Note: This bit will be cleared by writing 1 to it.
 * |[15]    |I2SENSTS  |I2S Enable Status (Read Only)
 * |        |          |0 = The SPI/I2S control logic is disabled.
 * |        |          |1 = The SPI/I2S control logic is enabled.
 * |        |          |Note: The SPI peripheral clock is asynchronous with the system clock.
 * |        |          |In order to make sure the SPI/I2S controller logic is disabled, this bit indicates the real status of SPI/I2S controller logic for user.
 * |[16]    |TXEMPTY   |Transmit FIFO Buffer Empty Indicator (Read Only)
 * |        |          |0 = Transmit FIFO buffer is not empty.
 * |        |          |1 = Transmit FIFO buffer is empty.
 * |[17]    |TXFULL    |Transmit FIFO Buffer Full Indicator (Read Only)
 * |        |          |0 = Transmit FIFO buffer is not full.
 * |        |          |1 = Transmit FIFO buffer is full.
 * |[18]    |TXTHIF    |Transmit FIFO Threshold Interrupt Flag (Read Only)
 * |        |          |0 = The valid data count within the transmit FIFO buffer is larger than the setting value of TXTH.
 * |        |          |1 = The valid data count within the transmit FIFO buffer is less than or equal to the setting value of TXTH.
 * |        |          |Note: If TXTHIEN = 1 and TXTHIF = 1, the SPI controller will generate a SPI interrupt request.
 * |[19]    |TXUFIF    |Transmit FIFO Underflow Interrupt Flag
 * |        |          |When the transmit FIFO buffer is empty and there is no datum written into the FIFO buffer, if there is more bus clock input,
 * |        |          | the output data depends on the setting of TXUFPOL and this bit will be set to 1.
 * |        |          |Note: This bit will be cleared by writing 1 to it.
 * |[20]    |RZCIF     |Right Channel Zero Cross Interrupt Flag
 * |        |          |0 = No zero cross event occurred on right channel.
 * |        |          |1 = Zero cross event occurred on right channel.
 * |[21]    |LZCIF     |Left Channel Zero Cross Interrupt Flag
 * |        |          |0 = No zero cross event occurred on left channel.
 * |        |          |1 = Zero cross event occurred on left channel.
 * |[23]    |TXRXRST   |TX or RX Reset Status (Read Only)
 * |        |          |0 = The reset function of TXRST or RXRST is done.
 * |        |          |1 = Doing the reset function of TXRST or RXRST.
 * |        |          |Note: Both the reset operations of TXRST and RXRST need 3 system clock cycles + 3 peripheral clock cycles.
 * |        |          |User can check the status of this bit to monitor the reset function is doing or done.
 * |[26:24] |RXCNT     |Receive FIFO Data Count (Read Only)
 * |        |          |This bit field indicates the valid data count of receive FIFO buffer.
 * |[30:28] |TXCNT     |Transmit FIFO Data Count (Read Only)
 * |        |          |This bit field indicates the valid data count of transmit FIFO buffer.
 */

    __IO uint32_t CTL;           /* Offset: 0x00  Control Register                                                   */
    __IO uint32_t CLKDIV;        /* Offset: 0x04  Clock Divider Register                                             */
    __IO uint32_t SSCTL;         /* Offset: 0x08  Slave Select Control Register                                      */
    __IO uint32_t PDMACTL;       /* Offset: 0x0C  SPI PDMA Control Register                                          */
    __IO uint32_t FIFOCTL;       /* Offset: 0x10  SPI FIFO Control Register                                          */
    __IO uint32_t STATUS;        /* Offset: 0x14  SPI Status Register                                                */
    __I  uint32_t RESERVE0[2];  
    __O  uint32_t TX;            /* Offset: 0x20  Data Transmit Register                                             */
    __I  uint32_t RESERVE1[3];  
    __I  uint32_t RX;            /* Offset: 0x30  Data Receive Register                                              */
    __I  uint32_t RESERVE2[11]; 
    __IO uint32_t I2SCTL;        /* Offset: 0x60  I2S Control Register                                               */
    __IO uint32_t I2SCLK;        /* Offset: 0x64  I2S Clock Divider Control Register                                 */
    __IO uint32_t I2SSTS;        /* Offset: 0x68  I2S Status Register                                                */

